[
  {
    "ISBN": "3540386084 | 9783540386087",
    "ISSN": "16113349 03029743",
    "abstract": "The contribution of this paper is that illustrates the use of funneling actions in combination with local deictic reference frames for forming consistent and useful large scale maps. These maps do not rely on any geodetic sensors. Indications for the feasibility of such representations in humans, and other species, can be found in studies of spatial cognition. However, such implementations or applications in robotics have not been illustrated until now.",
    "author": [
      {
        "family": "Pisokas",
        "given": "J."
      }
    ],
    "editor": [
      {
        "family": "Nolfi",
        "given": "Stefano"
      },
      {
        "family": "Baldassare",
        "given": "Gianluca"
      },
      {
        "family": "Calabretta",
        "given": "Raffaele"
      },
      {
        "family": "Hallam",
        "given": "John"
      },
      {
        "family": "Marocco",
        "given": "Davide"
      },
      {
        "family": "Miglino",
        "given": "Orazio"
      },
      {
        "family": "Meyer",
        "given": "Jean-Arcady"
      },
      {
        "family": "Parisi",
        "given": "Domenico"
      }
    ],
    "id": "Pisokas2006",
    "issued": {
      "date-parts": [
        [
          2006
        ]
      ]
    },
    "page": "274-285",
    "publisher": "Springer-Verlag Berlin Heidelberg",
    "title": "Global navigation through local reference frames",
    "type": "book",
    "volume": "4095 LNAI"
  },
  {
    "DOI": "10.1108/01439910610667881",
    "ISSN": "0143991X",
    "abstract": "Robots operating in the real world should be able to make decisions and plan ahead their actions. We argue that learning using generalized representations of the robot’s experience can assist such a ability. Design/methodology/approach: We present results from our research on methods for enabling mobile robots to plan their actions using generalized representations of their experience. Such generalized representations are acquired through a learning phase during which the robot explores its environment and builds subsymbolic (connectionist) representations of the result that its actions have to its sensory perception. Then these representations are employed by the robot for autonomously determining task-achieving sequences of actions (plans),for attaining assigned tasks. Findings: Such subsymbolic mechanisms can employ generalization techniques in order to pursue plans through unexplored regions of the robot’s environment. Originality/value: Subsymbolic motion planning can autonomously determine task-achieving sequences of actions in real environments, without using presupplied symbolic knowledge, but instead generating novel plans using previously acquired subsymbolic representations.",
    "author": [
      {
        "family": "Pisokas",
        "given": "J."
      },
      {
        "family": "Gu",
        "given": "D."
      },
      {
        "family": "Hu",
        "given": "H."
      }
    ],
    "container-title": "Industrial Robot",
    "id": "Pisokas2006a",
    "issue": "4",
    "issued": {
      "date-parts": [
        [
          2006
        ]
      ]
    },
    "keyword": "Learning, Plans, Robotics",
    "page": "270-277",
    "publisher": "Emerald Group Publishing Limited",
    "title": "Learning to plan for robots using generalized representations",
    "type": "article-journal",
    "volume": "33"
  },
  {
    "ISSN": "1062922X",
    "abstract": "The ability of a robot to estimate its location in the environment is crucial for variety of tasks. Several approaches have been developed offering either low cost solutions with low accuracy or high accuracy solutions at high cost. This paper presents a displacement sensor, for mobile robots, which exploits the frequency shift caused to a signal due to the robot’s motion. This method offers a low cost solution combined with higher accuracy than other approaches of similar cost. The achieved accuracy level in combination with the relatively low power consumption and weight make this sensor a reasonable choice for mobile robotics applications.",
    "author": [
      {
        "family": "Pisokas",
        "given": "J."
      }
    ],
    "container-title": "IEEE international conference on systems, man and cybernetics",
    "id": "Pisokas2005",
    "issued": {
      "date-parts": [
        [
          2005
        ]
      ]
    },
    "keyword": "Dead reckoning, Frequency shift, Localization",
    "page": "3516-3521",
    "title": "Frequency shift for position estimation in mobile robots",
    "type": "paper-conference",
    "volume": "4"
  },
  {
    "author": [
      {
        "family": "Pisokas",
        "given": "J."
      },
      {
        "family": "Nehmzow",
        "given": "U."
      }
    ],
    "container-title": "8th conference on intelligent autonomous systems",
    "id": "pisokas2004subsymbolic",
    "issued": {
      "date-parts": [
        [
          2004
        ]
      ]
    },
    "page": "666-673",
    "title": "Subsymbolic action planning for robots: Generalised representations of experience",
    "title-short": "Subsymbolic action planning for robots",
    "type": "paper-conference"
  },
  {
    "abstract": "Space and planetary exploration and construction can be significantly facilitated by the use of robotic technology, which can provide low risk and low cost means. Especially for remote missions, it seems necessary to use robots able to autonomously pursue mission goals specified beforehand by humans. One key competence that such an autonomous robotic agent should possess is the ability to plan sequences of activities for achieving mission goals. Current technologies base such planning skills on human intervention and/or a priori obtained maps of the operation environment. However, missions to remote unexplored planetary objects will not always have these privileges of pre-supplied maps of the landing and operation terrain and of frequent communication with human operators on earth. On the contrary we need robots able, after landing, to adapt to their environment and learn how to successfully operate in it autonomously for achieving pre-specified mission goals. Achieving such degrees of autonomy requires two capabilities of the robots: first, to be able to learn how to operate in a new environment and second, to be able to generalize over their experience in order to behave properly in novel situations by exploiting previous experience.",
    "author": [
      {
        "family": "Pisokas",
        "given": "J."
      }
    ],
    "container-title": "International astronautical federation - 55th international astronautical congress 2004",
    "id": "Pisokas2004",
    "issued": {
      "date-parts": [
        [
          2004
        ]
      ]
    },
    "title": "Subsymbolic path-planning for space and planetary exploration",
    "type": "paper-conference",
    "volume": "5"
  },
  {
    "DOI": "10.1016/j.robot.2004.08.008",
    "ISSN": "09218890",
    "abstract": "In this paper, we investigate the feasibility of building action-planning mechanisms capable of autonomously determining task-achieving sequences of actions (plans), using previously acquired subsymbolic representations. These subsymbolic representations are acquired by the robot autonomously during an exploration phase. Furthermore, we investigate whether such subsymbolic mechanisms can employ generalisation techniques in order to pursue plans through unexplored regions of the robot’s environment. Performance comparison of three subsymbolic action-planning mechanisms on different tasks conclude the paper.",
    "author": [
      {
        "family": "Pisokas",
        "given": "J."
      },
      {
        "family": "Nehmzow",
        "given": "U."
      }
    ],
    "container-title": "Robotics and Autonomous Systems",
    "id": "Pisokas2005a",
    "issue": "1",
    "issued": {
      "date-parts": [
        [
          2005
        ]
      ]
    },
    "keyword": "Action selection, Mobile robotics, Subsymbolic",
    "page": "55-67",
    "publisher": "Elsevier B.V.",
    "title": "Performance comparison of three subsymbolic action planners for mobile robots",
    "type": "article-journal",
    "volume": "51"
  },
  {
    "DOI": "10.1007/978-3-540-32274-0\\_14",
    "ISBN": "3540252606 | 9783540252603",
    "ISSN": "03029743 16113349",
    "abstract": "The ability to determine a sequence of actions in order to reach a particular goal is of utmost importance to mobile robots. One major problem with symbolic planning approaches regards assumptions made by the designer while introducing externally specified world models, preconditions and postconditions. To bypass this problem, it would be desirable to develop mechanisms for action planning that are based on the agent’s perceptual and behavioural space, rather than on externally supplied symbolic representations. We present a subsymbolic planning mechanism that uses a non-symbolic representation of sensor-action space, learned through the agent’s autonomous interaction with the environment. In this paper, we present experiments with two autonomous mobile robots, which use autonomously learned subsymbolic representations of perceptual and behavioural space to determine goal-achieving sequences of actions. The experimental results we present illustrate that such an approach results in an embodied robot planner that produces plans which are grounded in the robot’s perception-action space.",
    "author": [
      {
        "family": "Pisokas",
        "given": "J."
      },
      {
        "family": "Nehmzow",
        "given": "U."
      }
    ],
    "editor": [
      {
        "family": "Kudenko",
        "given": "Daniel"
      },
      {
        "family": "Kazakov",
        "given": "Dimitar"
      },
      {
        "family": "Alonso",
        "given": "Eduardo"
      }
    ],
    "id": "Pisokas2005b",
    "issued": {
      "date-parts": [
        [
          2005
        ]
      ]
    },
    "page": "216-229",
    "publisher": "Springer-Verlag",
    "title": "Experiments in subsymbolic action planning with mobile robots",
    "type": "book",
    "volume": "3394 LNAI"
  }
]
